export const skillLevelDescription = [
  {
    SkillLevel: "Lv1 ちょっとさわった",
    Detail:
      "その名の通り、ちょっと触った程度の理解度です。具体的にはチュートリアルを一通りこなしたほどです。",
  },
  {
    SkillLevel: "Lv2 利用できる",
    Detail:
      "その技術を使って制作物を作れる程度の理解度です。Qiitaや他の人のコードを利用して物を作成できます。しかし自分が使う部分しか理解していません。",
  },
  {
    SkillLevel: "Lv3 完全に理解した",
    Detail:
      "全体像を把握できた程度の理解度です。だいたいは理解したのでその技術のプロになったと思い込んでいます。しかし簡単な物しか作っていないので、実際は俗にいう「井の中の蛙」状態です。",
  },
  {
    SkillLevel: "Lv4 なんもわからん",
    Detail:
      "本質的に抱える問題に直面できる程度の理解度です。複雑な物を作成しようとした際に根本的に理解していないことに気付き、スキルレベル3の思い込みに気づいたので理解は深まっています。この状態になるとやればやるほど根本的な仕組みを理解していないことに気付きどんどん自信をなくします。ただ全体的に見ると理解度は深い方だと思います。",
  },
  {
    SkillLevel: "Lv5 チョットデキル",
    Detail:
      "本当に全てを理解している程度の理解度です。その技術を根本から理解し、わからないことなんてありません。",
  },
];
